from datetime import datetime
from datetime import timedelta
from random import randint
import threading
import OasisModule
import sknumber
from random import randrange


bkNumbers = ["010-4504-8751","010-4735-5642","010-5421-5617","010-4791-8761",
"010-8621-1297","010-8578-1283","010-6296-8743","010-9235-3491","010-4756-3491",
"010-8519-1292","010-4712-8742","010-8946-5627","010-9374-3491","010-8723-1286",
"010-8617-8764","010-6379-3496","010-4746-3491","010-7189-1286","010-9147-5614",
"010-4841-8749","010-6429-5614","010-9187-5639","010-5463-1295","010-9287-3497",
"010-4680-8751","010-6471-8746","010-5491-1284","010-5381-1297","010-8936-3463",
"010-6429-8743","010-4876-1297","010-9436-8742","010-7192-1274","010-6491-1291",
"010-8615-1275","010-5374-8758","010-5419-8746","010-8906-5617","010-4581-1294",
"010-8954-3493","010-9279-8743","010-4912-8752","010-8653-3471","010-4926-5642",
"010-9180-1286","010-4819-1281","010-9416-5609","010-6460-1291","010-4592-8743",
"010-9167-3473","010-4714-1281","010-4852-8743","010-6359-1273","010-6489-3498",
"010-4790-5618","010-4631-8762","010-9374-3463","010-8594-8743","010-4796-3491",
"010-4946-5619","010-8903-8749","010-5437-5603"]

familyNames = ['김','이','박','최','한','정','송','정','현']

frequentyNames = ["가윤","강민","규리","규민","나윤","나은","다온","다윤","다은",
"도연","도윤","도현","동현","민아","서연","서우","서은","서준","서진","서하",
"서현","선우","성민","성준","성현","소민","소율","수민","수빈","수아","수연",
"수현","수호","승민","승아","승우","승준","승현","시아","시온","시우","시현",
"아영","아윤","아인","연서","예나","예림","예빈","예서","예성","예지","예진",
"우진","유주","유찬","윤아","윤우","윤재","윤호","은서","은성","은채","은호",
"재민","재원","재윤","재현","주아","주원","주하","준서","준수","준영","준혁",
"준호","준희","지민","지수","지아","지안","지연","지완","지우","지원","지율",
"지은","지한","지현","지환","지후","지훈","진우","채린","채원","채은","태민",
"태현","하연","하율","현서","현우","혜원"]

tryNumber = 4
newNumber = []
if __name__ == "__main__":
    newNumber = sknumber.run(tryNumber)
    newNames = []
    while True:
        try:
            if len(newNumber) == 0:
                for i in range(tryNumber):
                    newNumber.append(bkNumbers[randrange(len(bkNumbers))])
            
            for i in range(tryNumber):
                newNames.append(familyNames[randrange(len(familyNames))]+
                                frequentyNames[randrange(len(frequentyNames))])
            break
        except:
            print('again')

    targetDate = (datetime.now()+timedelta(days=7)).date().__str__()
    
 
    threadArr = []
    for i in range(tryNumber):
        t = threading.Thread(target=OasisModule.reserveOasis, args=(newNames[i],i+2,newNumber[i],targetDate))
        
        threadArr.append(t)
        t.start()


    print("Done")
    input()
